Repository: Richi2293/ricreviews
Catalog: languages/ricreviews-*.po
Languages: it_it

source: RicReviews Settings
it_it: Impostazioni RicReviews

source: You do not have sufficient permissions to access this page.
it_it: Non hai i permessi sufficienti per accedere a questa pagina.

source: ℹ️ Important Information:
it_it: ℹ️ Informazione Importante:

source: Google Places API returns a maximum of 5 reviews per place. This is a limitation imposed by Google, not by the plugin.
it_it: Google Places API restituisce un massimo di 5 recensioni per luogo. Questa è una limitazione imposta da Google, non del plugin.

source: The plugin performs periodic fetches (configurable below) to update reviews. Over time, you may accumulate more reviews in the database as Google updates the "5 most helpful reviews" for your place.
it_it: Il plugin effettua fetch periodici (configurabile di seguito) per aggiornare le recensioni. Nel tempo, potresti accumulare più recensioni nel database man mano che Google aggiorna le "5 recensioni più utili" per il tuo luogo.

source: To get all reviews:
it_it: Per ottenere tutte le recensioni:

source: If you are the owner of the business, you can use Google My Business API to access all reviews. Otherwise, this limitation is unavoidable with Google's official APIs.
it_it: Se sei il proprietario dell'attività, puoi utilizzare Google My Business API per accedere a tutte le recensioni. Altrimenti, questa limitazione è inevitabile con le API ufficiali di Google.

source: Read Google's official documentation →
it_it: Leggi la documentazione ufficiale di Google →

source: Google Places API Key
it_it: Chiave API Google Places

source: Enter your Google Places API key. Get one from
it_it: Inserisci la tua chiave API Google Places. Ottienila da

source: Important:
it_it: Importante:

source: You must enable
it_it: Devi abilitare

source: Places API (New)
it_it: Places API (Nuova)

source: in your Google Cloud Console. The legacy Places API is no longer available for new projects.
it_it: nella tua Google Cloud Console. La vecchia Places API non è più disponibile per i nuovi progetti.

source: Enable Places API (New) →
it_it: Abilita Places API (Nuova) →

source: Enter the Google Place ID for the location you want to display reviews for.
it_it: Inserisci il Google Place ID per la posizione di cui vuoi visualizzare le recensioni.

source: How to find your Place ID:
it_it: Come trovare il tuo Place ID:

source: Go to
it_it: Vai su

source: and search for your business location
it_it: e cerca la posizione della tua attività

source: Click on your business in the search results or on the map
it_it: Clicca sulla tua attività nei risultati di ricerca o sulla mappa

source: In the business information panel, scroll down and look for the Place ID (it looks like: ChIJN1t_tDeuEmsRUsoyG83frY4)
it_it: Nel pannello informazioni dell'attività, scorri verso il basso e cerca il Place ID (sembra: ChIJN1t_tDeuEmsRUsoyG83frY4)

source: Alternatively, use the
it_it: In alternativa, usa lo

source: Place ID Finder tool
it_it: strumento Place ID Finder

source: from Google
it_it: di Google

source: Learn more about Place IDs →
it_it: Scopri di più sui Place ID →

source: Number of Reviews
it_it: Numero di Recensioni

source: Select how many reviews to display.
it_it: Seleziona quante recensioni visualizzare.

source: Sort By
it_it: Ordina Per

source: Most Recent
it_it: Più Recenti

source: Oldest First
it_it: Più Vecchie Prima

source: Highest Rating
it_it: Valutazione Più Alta

source: Select how to sort the reviews.
it_it: Seleziona come ordinare le recensioni.

source: Primary Color
it_it: Colore Primario

source: Choose the primary color for the reviews display.
it_it: Scegli il colore primario per la visualizzazione delle recensioni.

source: Theme
it_it: Tema

source: Light
it_it: Chiaro

source: Dark
it_it: Scuro

source: Select the theme for the reviews display.
it_it: Seleziona il tema per la visualizzazione delle recensioni.

source: Save Settings
it_it: Salva Impostazioni

source: Usage
it_it: Utilizzo

source: Use the following shortcode to display reviews on any page or post:
it_it: Usa il seguente shortcode per visualizzare le recensioni su qualsiasi pagina o articolo:

source: Reviews Preview
it_it: Anteprima Recensioni

source: No reviews found.
it_it: Nessuna recensione trovata.

source: Make sure you have:
it_it: Assicurati di avere:

source: Entered a valid Place ID
it_it: Inserito un Place ID valido

source: Entered a valid API key with Places API (New) enabled
it_it: Inserita una chiave API valida con Places API (Nuova) abilitata

source: Saved the settings to fetch reviews
it_it: Salvato le impostazioni per recuperare le recensioni

source: Fetch Reviews Now
it_it: Recupera Recensioni Ora

source: Debug Information
it_it: Informazioni di Debug

source: review(s) found in database.
it_it: recensione/i trovata/e nel database.

source: Note:
it_it: Nota:

source: Google Places API returns a maximum of 5 reviews per fetch. The plugin automatically updates reviews every 24 hours via cron job.
it_it: Google Places API restituisce massimo 5 recensioni per fetch. Il plugin aggiorna automaticamente le recensioni ogni 24 ore tramite cron job.

source: Settings saved successfully.
it_it: Impostazioni salvate con successo.

source: You do not have permission to perform this action.
it_it: Non hai il permesso di eseguire questa azione.

source: API key and Place ID are required.
it_it: Chiave API e Place ID sono obbligatori.

source: API key is valid.
it_it: Chiave API valida.

source: No reviews found for this Place ID.
it_it: Nessuna recensione trovata per questo Place ID.

source: Successfully fetched %d review(s).
it_it: Recuperate con successo %d recensione/i.

source: Place ID and API key are required.
it_it: Place ID e chiave API sono obbligatori.

source: Request failed: %s
it_it: Richiesta fallita: %s

source: Google Places API rate limit exceeded. Please try again later.
it_it: Limite di richieste Google Places API superato. Riprova più tardi.

source: Invalid Google Places API key or Places API (New) is not enabled.
it_it: Chiave API Google Places non valida o Places API (Nuova) non abilitata.

source: You need to enable Places API (New) in your Google Cloud Console. The legacy API is no longer available for new projects.
it_it: Devi abilitare Places API (Nuova) nella tua Google Cloud Console. La vecchia API non è più disponibile per i nuovi progetti.

source: Invalid Google Place ID.
it_it: Google Place ID non valido.

source: Google Places API returned error code: %d
it_it: Google Places API ha restituito codice di errore: %d

source: Failed to parse API response.
it_it: Impossibile analizzare la risposta dell'API.

source: Unknown API error.
it_it: Errore API sconosciuto.

source: API key cannot be empty.
it_it: La chiave API non può essere vuota.

source: API key format appears invalid.
it_it: Il formato della chiave API sembra non valido.

source: Please configure RicReviews settings in WordPress admin.
it_it: Configura le impostazioni di RicReviews nell'admin di WordPress.

source: No reviews available at this time.
it_it: Nessuna recensione disponibile al momento.

source: Additional Languages (Optional)
it_it: Lingue Aggiuntive (Opzionale)

source: Enter additional language codes separated by commas (e.g., "en,fr,de"). The plugin will fetch reviews in these languages in addition to the default language.
it_it: Inserisci codici lingua aggiuntivi separati da virgole (es. "en,fr,de"). Il plugin recupererà le recensioni in queste lingue oltre alla lingua predefinita.

source: Each language requires a separate API call. Leave empty to use only the default language (based on WordPress locale).
it_it: Ogni lingua richiede una chiamata API separata. Lascia vuoto per usare solo la lingua predefinita (basata sulla locale WordPress).

source: Shortcode Parameters:
it_it: Parametri dello Shortcode:

source: Number of reviews to display (default: from settings)
it_it: Numero di recensioni da visualizzare (predefinito: dalle impostazioni)

source: Sort by: time, time_asc, rating (default: from settings)
it_it: Ordina per: time, time_asc, rating (predefinito: dalle impostazioni)

source: Order direction: ASC or DESC (default: from settings)
it_it: Direzione ordine: ASC o DESC (predefinito: dalle impostazioni)

source: Language code to filter reviews (e.g., "it", "en"). If not specified, uses WordPress locale (default)
it_it: Codice lingua per filtrare le recensioni (es. "it", "en"). Se non specificato, usa la locale WordPress (predefinito)

source: Examples:
it_it: Esempi:

source: Display reviews with default settings and WordPress locale
it_it: Visualizza recensioni con impostazioni predefinite e locale WordPress

source: Display only English reviews
it_it: Visualizza solo recensioni in inglese

source: Display 5 Italian reviews
it_it: Visualizza 5 recensioni in italiano

source: Languages must be a non-empty array.
it_it: Le lingue devono essere un array non vuoto.

source: Last fetch:
it_it: Ultimo recupero:

source: ago
it_it: fa

source: Weekly
it_it: Settimanale

source: Monthly
it_it: Mensile

source: Enable Automatic Updates
it_it: Abilita Aggiornamenti Automatici

source: Enable or disable the automatic fetching of reviews.
it_it: Abilita o disabilita il recupero automatico delle recensioni.

source: Update Frequency
it_it: Frequenza Aggiornamento

source: Daily
it_it: Giornaliero

source: Select how often to fetch new reviews.
it_it: Seleziona la frequenza con cui recuperare nuove recensioni.
